# Reading a CSV File with pd.read_csv()

## Pokemon data

In [1]:
import pandas as pd

In [2]:
# read_csv and others will always import as a data frame
# COLUMNS = SERIES
infile = "pokemon.csv"
pd.read_csv(infile)

        Pokemon     Type
0     Bulbasaur    Grass
1       Ivysaur    Grass
2      Venusaur    Grass
3    Charmander     Fire
4    Charmeleon     Fire
..          ...      ...
716     Yveltal     Dark
717     Zygarde   Dragon
718     Diancie     Rock
719       Hoopa  Psychic
720   Volcanion     Fire

[721 rows x 2 columns]

read_csv will always import a data frame, which is a collection of series
COLUMNS = SERIES

In [3]:
# To limit which columns are read in, do this
pd.read_csv(infile, usecols=["Pokemon"])

        Pokemon
0     Bulbasaur
1       Ivysaur
2      Venusaur
3    Charmander
4    Charmeleon
..          ...
716     Yveltal
717     Zygarde
718     Diancie
719       Hoopa
720   Volcanion

[721 rows x 1 columns]

In [4]:
# To get a single series out of a csv, limit to one column and use squeeze
# squeeze does columns by default, but you can also put "columns" to be sure lol
pokemon = pd.read_csv(infile, usecols=["Pokemon"]).squeeze("columns")
pokemon

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
          ...
716       Yveltal
717       Zygarde
718       Diancie
719         Hoopa
720     Volcanion
Name: Pokemon, Length: 721, dtype: object

## Google Stock Price

In [5]:
pd.read_csv("google_stock_price.csv")

      Stock Price
0           50.12
1           54.10
2           54.65
3           52.38
4           52.95
...           ...
3007       772.88
3008       771.07
3009       773.18
3010       771.61
3011       782.22

[3012 rows x 1 columns]

In [6]:
google = pd.read_csv("google_stock_price.csv", usecols=["Stock Price"]).squeeze()
google

0        50.12
1        54.10
2        54.65
3        52.38
4        52.95
         ...
3007    772.88
3008    771.07
3009    773.18
3010    771.61
3011    782.22
Name: Stock Price, Length: 3012, dtype: float64